{
    "group": "圣火与猫",
    "cards": [
      {
        "name": "O·圣火·首牌",
        "牌意": "你现在进入了火族的领土。它们的徽章意味着勇敢、勇气和创造力能茁壮成长的地方。你在这里遇到的猫都会挑战你，促使你朝着伟大发展。火族猫的旅程就是行动。",
        "猫的启示": "创造性的机会现在唾手可得，充分利用这些机会的力量和意志力也在。若你再考虑新的开始现在正是时候，你事物的热情追逐将会推着你前进。如果你抽出这张牌来问问题，答案都是“是的”。",
        "逆位": "火焰已熄灭，正在考虑的事情的力量也在变低。保存资源直到激情恢复。什么将重新点燃你的兴趣？如果你抽出这张牌问问题，答案就是“还没有”。"
      },
      {
        "name": "II·圣火·二",
        "牌意": "在世界间停下，这只猫正在考虑它的选择。到外面漆黑一团中冒险，还是有光住处的安全和庇护。火族猫生来就是为了冒险的，但从她现在所处安全位置离开，到她要去的那个潜在地方不是件贸然着急的事情。从门槛的优势位置来看，这只猫在衡量她需要的所有时间。",
        "猫的启示": "前面有可以冒险的潜力，但现在却不是行动的时间。仔细考虑一下，慎重的观察和考虑比贸然向前要好的多。",
        "逆位": "你在等什么？这并非夸大其词。考虑一下行动前你还需要知道或获得的东西。如果你需要，从其他人处收集更多信息，但首先要相信自己的直觉。"
      },
      {
        "name": "III·圣火·三",
        "牌意": "猫是好奇的生物。我们想知道那禁闭的门后是什么。向未知的纵身一跳是需要勇气的，但我们还能怎么从黑暗到光明呢？这只勇敢的猫正要做这信仰的一跳。是视线外的东西在吸引它 - 也许就是召唤的神秘本身，是满足她对光亮来源的好奇心的渴望。",
        "猫的启示": "现在是离开一直的安全地时候了，向前的下一步需要冒些险，但由此得到的奖赏远远好过弥补。你在黑暗中待的时候够长了。如果想要找到光明，你必须跳进光明。",
        "逆位": "抓住机会就是我们学习和成长的方式，但是这种情况下需要进一步的考量，有可能是危险的。三思而后行。"
      },
      {
        "name": "IV·圣火·四",
        "牌意": "每个宗族都有它们自己古老的行程仪式，有它们自己与神圣猫界联系的方式。对于火族猫，这个更高尚的宗族，所有魔力的来源就是光。在它们的众多的神殿中，它们在闪闪发光的秘境下沉思，崇拜他们内在发光的美丽。",
        "猫的启示": "世俗的现实可能无法完全滋养你的灵魂，为惊奇、美丽，魔法和与神灵的联系留出时间。如果你有宗教或精神法事，都要给予日常的时间和关注。如果你不做这些法事，可能需要时间去创造一个。寻找光明。",
        "逆位": "第四张圣火与猫牌倒了跟正着传达同样的意思。只是额外增加了带别人进入你的仪式并探索内在的神秘光亮。"
      },
      {
        "name": "V·圣火·五",
        "牌意": "获得新技能的最好办法就是玩耍，在我们小的时候我们就很擅长了。甚至最小的猫也会扑，潜行。学会了进攻和谦恭的姿势。当它们丝绒般的小爪从它们同伴身上翻过去时，小小的喉咙里发出如虎般的咆哮。这都很好，而且在日后，面对增长的挑战时它们会表现的很好。",
        "猫的启示": "参与竞争能提升你的技能水平，但你确保是在友好的氛围中进行。如果那里气氛紧张，用幽默和好的运动精神化解。记住你们是一起的。",
        "逆位": "若有人在这里是要流血而不是朝着共同的目标竞争。你要在取得进展前解决争端和争执。"
      },
      {
        "name": "VI·圣火·六",
        "牌意": "什么成就了杰出猫？那些猫天生就是领导，不管是在同类的战斗中获胜还是成功地获取领地。其他猫仅通过其个人魅力散发出的温暖，尊重都会展示给高贵的人，并被优雅地接受。当一只猫值得尊重，请不要犹豫给出你的尊重。所有的宗族都会从这样的典型中受益。",
        "猫的启示": "如果给你领导的岗位，心怀感激地优雅接受。这给你提供了充分发挥你天资的机会，并且你也赢得了这样的机会。接受并在个人提升中承担相应的责任。让自己成为别人成就伟大的榜样。",
        "逆位": "不要让权利的地位冲昏头脑。既能给你尊重，也会将这种尊重收回。其他人可能以对你心生嫉妒或愤恨。你要当心并要诚实行事。"
      },
      {
        "name": "VII·圣火·七",
        "牌意": "当正义在侧面，火族猫从来不会从战斗中退缩。对领地的挑战不单依靠体力而是依赖个人力量的强度。当猫再面对想要把自己从正当的地方抓住的对手时，他会展现他的力量和勇气来挡开，这些猫不会绕过！",
        "猫的启示": "尽管这些逆境似乎是针对你的，但是你的事业是正义的，你就在力量的位置上。其他人可能会挑战你并测试你对所选事业的承诺。保持你的理想。",
        "逆位": "不断的防卫是很费劲的。如果那些反对你的不退让，或是你一直觉得处于危险中或是进攻中，这不利于打好根基。考虑一下如何前行或是找到新的退让的方法。"
      },
      {
        "name": "VIII·圣火·八",
        "牌意": "我们已经感受到它。通常在每天日夜交替的时候 - 黎明或黄昏 - 但也可能随时降临。对速度的那种不可思议的需要，不需要目标，不需要猎物或激励，就是内心深处的想要有多快跑多快的野性冲动，即使在最温顺的斑猫身上都有体现。这种力量无法控制，必须采取激烈的行动来实现这种神秘召唤的快乐和疯狂。",
        "猫的启示": "如果你需要动起来，那么就动起来。应该听从圣火要有所改变的那种无休止的渴望。你可能感到立即对那些你已拖延很久事情采取行动的迫切性。利用好这种冲动。充分利用灵魂深处的力量的爆发。",
        "逆位": "没有重点的行动只能耗尽你的能量却达不到好的目的。最好听从你的内心，是时候停止无谓的冲动了。平静一下。设定目标，即使短期的也好，不要仓促地做任何事情。"
      },
      {
        "name": "IX·圣火·九",
        "牌意": "火族猫聚在它们的大会议室议会，将会提升它们的魔力并散发出增强它们宗族的力量。它们掌握了神秘基础的本质，那就是火，并通过意志的力量将它们安全地保存起来。专注于金色的火焰，每只猫都感受到了答案般的燃烧灵魂的火花。这是猫族最好最耀眼的力量。",
        "猫的启示": "你有全部的技能，力量，和意志力来实现你的目标。你已控制了自己的激情。能够通过某种途径变成有创造力的显现。你现在的行为能对你周围的人都有益。",
        "逆位": "你的创造性的火需要关注和发泄，但当你是一个人时就很难保持。好注意会告吹，项目搁浅或是遗忘，转换的能量变得暗淡甚至消亡。找到那些分享你激情的其他人，他们会帮助你使你的兴趣一直鲜活。"
      },
      {
        "name": "X·圣火·十",
        "牌意": "第九章上的火族猫会议失去了对火的控制。很多能量都立马释放出去。能量的爆发对猫来说太热了而无法处理。甚至灵魂的热情若不明智，使用也会太多。议会集体意识成为泡影，现在是为自己考虑的时刻。",
        "猫的启示": "当事情不稳定时，在继续之前，你必须等到它们冷静下来。此时应找到混乱的原因，是否承担太多？是不是该任务已经让你黄金时代过去了？重新考虑你下一步的策略这样就不会浪费你的技能和能量。",
        "逆位": "能量搁浅，事情很快就会更平静。不用觉得你需要赶快扑灭所有小火苗，他们会照顾好自己或是别人会处理的。不要承担太多或烦躁不安的挥霍你的力量。"
      },
      {
        "name": "XI·圣火·幼猫",
        "牌意": "天哪，多么美丽的火！它移动着飞舞着，吸引着好奇的小猫越来越近，越来越近…这不是了解火的唯一办法，火族小猫很快就学会了。",
        "猫的启示": "好奇心使你对新项目和快乐的热情闪闪发亮。当在没有设想和预想时获取新技能和探索新激情时，今天的发现为你日后的成长提供了机会，在这过程被烧了一点不要感到害怕。变化就是你成长和学习的方式。",
        "逆位": "抓住机会是好的，但要当心不要在寻求新经历时失去平衡。不要参加危险的或不成熟的行动，也不要这样鼓励别人。继续前，从火焰那里往后退并对形势再洞察一下。"
      },
      {
        "name": "XII·圣火·雄猫",
        "牌意": "勇敢和优雅的缩影，火族雄猫快速地滑过一片蜡烛，它轻盈的步伐就像是火焰中的一阵热风。他的眼睛从未从它的目标上移动半点。当这只雄猫想要取得什么时，它就全神贯注，在追求它的渴望时，它可以稍微大胆些。这是运气和技能的结合。也带些许胆量。",
        "猫的启示": "如果你保持前进和不鲁莽行事，勇气和勇敢会帮你迎接挑战。相信你从磨难和错误中习得的技能，要获得想要的这些并不够，你必须采取行动去实现。朝着你的目标快速信心满满地奔过去。",
        "逆位": "远离热区，采取行动前预测你所处的情景。快速反应的天性目前不会很好地服务你，可能让你被烧伤。如果需要，理性思考一下并采取别人的建议。"
      },
      {
        "name": "XIII·圣火·猫皇后",
        "牌意": "沉着地看着她引以为傲的烟火，火族王后陶醉于烟火的美丽和魔法中。王后喜欢这些娱乐和闪闪发光的玩具。她是个冒险家。王后是和善和让人尊敬的，她更多地陶醉于狩猎时追逐所带来地乐趣而不是杀戮。作为伴侣她富有激情，她喜欢小猫的童心和不可预测性。这个王后的幽默感让她心里放松。她是灵感和视觉创意的来源。",
        "猫的启示": "什么使你的眼闪闪发光？什么鼓舞了你激情的火焰？当你对生活充满热情时，你的精神也鼓舞着别人闪闪发光。找到你自己的深思所在，这样就可以继续成为别人沉思的对象。",
        "逆位": "目前你对生活的激情可能受到了抑制。如果你对那些通常能激励的东西失去了兴趣，你可以试着找到重新鼓励这些火花的方法或是转向新的激情，不管是哪种，你都要先召回内心的热情。"
      },
      {
        "name": "XIV·圣火·猫国王",
        "牌意": "火族国王的个人魅力和贵族精神闪耀着。他勇敢的心用于面对任何挑战。如果需要，他做好了战斗的准备，尽管他很少发动战争。他的信心和幽默鼓舞了族人的忠诚，愿意接受他的领导。他勇敢，浪漫，富有激情，母猫们都爱慕他。国王积极地态度不允许任何挫败的想法，他对其他人的恐惧没有耐心。他是勇气的化身。",
        "猫的启示": "自豪地站在那里，召唤你的能量。没有能否认你所有具备的好的领导人的特质而且还能用自己的信心激励他人。如果全力投入，不论你现在的承担任何任务都会很好地完成。",
        "逆位": "当心不要滥用权力。不要对他人的能力做出快速的评判，因为他们可能是你的竞争对手并需要承担他们的责任。滥用权力将会使你失去他人的支持。"
      }

    ]
  }