{
  "group": "大地与猫",
  "cards": [
    {
      "name": "O·大地·首牌",
      "牌意": "你现在正进入土族的领地。他们象征了能找到美食和柔软护佑的地方。在这里遇到的猫都很耐心和慷慨。土族猫之旅就是舒适之旅。",
      "猫的启示": "在整个星球上一些好东西正在走近你。这可能是礼物，财务上的富足，或是良好的健康状况。不管是什么，记得要感恩。感激保持富足继续。如果你抽出这张牌提问，答案是 YES。",
      "逆位": "因为精力太分散和不持续，没有正确的看清眼前事物而错失机会。你可能会怀疑自己的运气或者因为粗心或拖延而挥霍了自己的运气。如果你抽到这张牌提问，答案可能是 YES 也可能是 NO，这取决于你是否接受给予的礼物。"
    },
    {
      "name": "II·大地·二",
      "牌意": "与这个星球的力量完美结合，土族猫能达到特别的平衡，即使对猫也如此。以自己的身体为中心并接地气，他们能轻易地保持平衡。童心和幽默帮助保持了土族猫的实际天性，而不必太严肃，很好平衡自己。",
      "猫的启示": "找到你的平衡中心和内心的平衡点。这对同时执行太多任务的你尤为重要。慢下来，冷静地自信地控制住局面。",
      "逆位": "因为没够给予足够的严肃对待，会有资源或财富的损失。无需惊慌，但要归置好你的物质财物避免灾祸。保护好你辛苦工作取得的东西。"
    },
    {
      "name": "III·大地·三",
      "牌意": "猫以他们的独立而闻名，但有些挑战需要团队合作。要把这个大甲虫分三份，这个三个伙伴会让它到他们想让它去的地方-特别是离开他们的居住地。单独工作的猫在放牧甲虫或抵御攻击时也是会有沮丧的时候。通过合作，这些猫能够轻易地达到他们的目标并在整个过程中获得乐趣。",
      "猫的启示": "当一起工作时，那些看似无法解决的问题也可以控制了，而且是愉快地控制。考虑一下团队工作会带来的益处。为共同的目标采取创造性的合作。",
      "逆位": "如果自己承担的太多，这并不能使你独立，并使你受到折磨。除了合理的不要应付太多了，不然就会因单独作战而精疲力竭。寻求帮助。"
    },
    {
      "name": "IV·大地·四",
      "牌意": "作为猫的乐趣之一就是有自己特定的玩具和其他财产，我们都有我们自己的一套自己喜欢的东西。但有些猫也采取极端手段。在物质面前有的猫没有分寸，他们不知道如何想用自己的玩具，要求更多的贪欲成了他生活的唯一重心。孤独，疑心重，只顾保护他那都积尘了的囤积。",
      "猫的启示": "如果忘记跟玩具玩，那么世界上的所有玩具就根本没有价值。对物质贪欲的根本原因是什么？有些空虚需要填补，但是囤积东西根本无法填补。从同伴的陪伴中寻求安慰，和单纯的快乐。",
      "逆位": "当身体和精神的不适被释放后，你就会感觉到（很快就会感受到）精神负担的减轻。继续清理那些无法帮助你的东西，包括想法和关系。真正有价值的东西就会保留下来。"
    },
    {
      "name": "V·大地·五",
      "牌意": "无论是因自己的选择还是无法控制的环境因素，造成的无法享受舒适都是痛苦的。对爱家的土族猫而言，这种渴望特别强烈。透过结霜的窗户，这只孤独的猫看到满是自己梦想的生活。温暖的庇护，惬意的陪伴，充足的食物。时间会告诉你他是否找到将这些梦想变为现实的方法。",
      "猫的启示": "环境可能让你觉得孤独和有需要，很自然地就会感到悲伤或沮丧。选择停留在这种感觉里还是向前进都取决于你自己。富足和舒适正在接近，但仍需要你的努力才能保留。",
      "逆位": "消极会让你失望，此时你可能会陷入自怜的危险中。这不是说不要面对挑战，沉迷于你没有的东西没有生产力。让自己走出这种忧郁的漩涡，采取切实的行动改变现实。"
    },
    {
      "name": "VI·大地·六",
      "牌意": "不同于土五中的那只寒冷饥饿的猫，这对母子已在这只慷慨的土族猫这里找到欢迎他们的庇护所，而且这只慷慨的土族猫有足够的东西分享。这位母亲知道她必须信任她恩人的好意并告诉她的孩子若有需要接受帮助并不可耻。这只土族猫用爱和食物祝福她的客人，因为给予她也受到了祝福。",
      "猫的启示": "大方地跟那些不太富裕的人分享你的生活。如果你是那个需要帮助和关怀的人，不要太矫情而不去接受他人给予的帮助。记住赠予者会受到祝福，接收者也会受到祝福。交换是平等的，所以不必犹豫也不因感到负债而担心。",
      "逆位": "给予的帮助会得到延伸。如果接受你可能感到深深的义务感，就会仔细权衡做出的决定的回报是否值得这个代价。如果你是个吝啬的人，就考虑一下动力。自愿的给予或就根本不要给予。"
    },
    {
      "name": "VII·大地·七",
      "牌意": "这只猫的的耐心是出了名的。安静地和下定了决心，这只土族猫等在也图的窝外，她知道她的猎物肯定会在什么时候出来。这工作并不容易-并不是每次狩猎都能成功，这种等待对神经和身体都有损害。但是若通过坚持和技能，这只猫能给她的家庭给养，这种努力也是值得的。",
      "猫的启示": "行动的时机尚未成熟。要有耐心-不仅仅是安静的呆着而且要冷静的接受等待的公正。不安的急躁和不耐烦只能对你的猎物提出警告。静下心来等。",
      "逆位": "你对当前的形式担心地太多。不要时刻都关注这个，而其他的需求都被忽略了。也匀给其他的一点精力，让这个问题自我关心一下。"
    },
    {
      "name": "VIII·大地·八",
      "牌意": "我们生来就有强大的本能，但还是需要技能。这位母亲带着她的孩子出来体验夜间狩猎。自信地观察着，小猫在学习如何集中精力和警觉。他们看到她熟悉夜风的每一缕声响，高高的草丛的每一阵沙沙的声音。熟悉地形，她能灵敏地和确定无误地行动。她自信地跟她的孩子交流着，那小猫非常信任的跟随着她的脚步。",
      "猫的启示": "所有的技能都能在实践中得到锻炼。不要期望在第一次就对某事精通。随着时间的推移和不停的训练，你就会越来越擅长。这会帮助你找到老师跟你分享她的专长。如果你控制了自己，那是时候传承优秀的遗产。",
      "逆位": "所有的工作没有玩耍会真正对这个迟钝的小猫有利。你已工作的太辛苦了，对提高技能或地位倾注太多关注。花点时间采取行动，事关快乐而不是成就。"
    },
    {
      "name": "IX·大地·九",
      "牌意": "宗族生活的快乐是伟大的，但是独处中也有幸福，特别是随着年岁的增长，我们可能想放慢生活的脚步。这只土族猫宁静平和地透过她有围墙的花园观察着外面的世界。别的猫不跟她同住，但她并不孤独。她的思想和记忆都有足够多的陪伴，她明智的内心满是心满意足。",
      "猫的启示": "你已经赢得了在阳光中的位置。对独处的满足，宣布你的权利。深思自己的美丽是一种成功，这种成功能很好地滋养灵魂。并不是每一样东西都要分享，即使跟最爱的人也不用。精神家园里深深的幸福在等着你。",
      "逆位": "在家呆时间太多就会觉得受约束而不是满足。外面的世界在召唤你。世俗的要求正在蚕食你的撤退空间。曾经的魔力现在觉得很世俗，所有闪亮点在例行常规和千篇一律中消耗殆尽。要走出去看看外面的世界。"
    },
    {
      "name": "X·大地·十",
      "牌意": "对猫来说，找到一个我们自己的特殊地方比什么都重要。在这里我们完全安全和受到保护，在这里我们可以放松并重新回归猫的本性。欢迎其他猫进入我们珍惜的领地是真正的荣誉，代表我们信任这种陪伴并感到安全。这是我们舒适的庇护所。",
      "猫的启示": "这是回应你内心呼唤的时候了。如果你敞开胸怀接受快乐，你会毫不费力的得到快乐。你会收获和善，友情和爱情。如果你抽出这张牌问问题，答案都是 YES。感到安全可靠的时刻最重要。现在你的居住地和财产让你感到巨大的舒适，不论是独处还是跟朋友和家庭分享这种快乐。找到属于你的特定地方并定居下。让你觉得自在，这种沉思会让你更了解自己。",
      "逆位": "找到特定的地方是一回事，但是拒绝离开这个地方又是另一回事。如果你只在熟悉的环境中感到安全，你失去了感受新的快乐和舒适的机会，也许这些超越了你已知的。不用害怕任何事情-你的支持系统是强大的，你总是能找到自在的方法。"
    },
    {
      "name": "XI·大地·幼猫",
      "牌意": "跟新朋友鼻子对鼻子，这只土族的小猫没有感到害怕，只感到一点羞涩。因为她被爱养育大，所以她有令人信任的灵魂。她的感觉跟周围那个有着各种各样气味，声音和生物的世界相处和谐。要完全学会谨慎对待需要时间，但她的天性在她的探索中觉得安全。",
      "猫的启示": "缓慢地但笃定地，你正在学习实际的技能，增加你对世界的运转方式的知识。现在这些感觉给了你巨大的快乐，例如尝试新的食物，在尚未探索的地方寻找美丽。学习和其他安静的消遣特别有益。",
      "逆位": "你可能感到不安和不安全，这样你就会犹豫不决和拒绝继续生命之旅。当你对前进或出去探索世界感到害怕，首先找到基本的安全感。什么能使你感到安全？"
    },
    {
      "name": "XII·大地·雄猫",
      "牌意": "当在宗族领地上巡逻时，这只土族雄猫偶遇这种与自己的同伴走失的小猫。没有任何迟疑，这只雄猫带上小猫克服了所有困难安全地把她送回家。自己没有伴侣或孩子，这只土族雄猫就致力于保护自己的宗族。在帮助他人时，他感到莫大的满足，并深受自己族人的爱戴。",
      "猫的启示": "稳定的工作和乐于助人的意愿，你正在为自己未来的事业打下坚实的基础。提高技能的那种耐心的专注将保证你的富足和自力更生。这张牌也可能指那个能给你特殊帮助和支持的人。",
      "逆位": "照顾好自己的健康不要承担过多的工作。可能你帮助过的人没有正确地对你表达他们的感激之情。跟他们要你应得的，或是就让这件事愉快地过去，就当体验的工作本身的乐趣。"
    },
    {
      "name": "XIII·大地·猫王后",
      "牌意": "端坐在她豪华的花园里，土族王后从自然界集聚力量以保护和养育她关心的人。她性情温和，不轻易烦躁和慌张，这些都使她不仅受到自己宗族的爱戴，也受到她亲切欢迎的友好的来访者的爱戴。土族王后总是乐于拥抱他人，没有什么比养育和关心她的孩子能给她带来更多的快乐。作为伴侣，她总是全身心投入和身体力行地跟她的配偶一起分担责任。她的首要责任就是确保宗族和自己过着舒服的生活。",
      "猫的启示": "参与实际事情花费了你很多的精力，你对从物质上和精神上关心和养育他人感到自豪。记住要从自己的情感乐趣和照顾好自己的幸福中获得乐趣。这是常识而且随处可见。",
      "逆位": "你可能对无休止的每天要做的事情感到筋疲力尽。对工作和家庭的义务正在消磨你的力量和好脾气。当养育成为令人讨厌的工作时，就失去了它的价值，让别人照顾你一段时间吧。"
    },
    {
      "name": "XIV·大地·猫国王",
      "牌意": "跟他的伴侣一样，土族国王也是致力于保护和供养他的宗族和家庭。他乐善好施，热心肠，他的出现让周围的人感到安全。他不仅了解同辈的猫，也了解过去踏过他领地的几代猫，以及保持和平是他对祖先所肩负的责任。国王的和善，慷慨，朴实的实用主义。使他受到在自己宗族内外遇到的每只猫的爱戴。",
      "猫的启示": "其他人依赖于你的实用性和稳定性。评估自己的物质所有以保证持续的富足，这也包括有足够多的东西与人分享。在帮助他人感到可靠和安全带给你很多的满足感，不论是在家，还是在工作场所，或是更大的群体。",
      "逆位": "也许是时候告诉那些依赖你的人要自立和自己处理问题，特别是财物上和物质上。让他们在物质上依赖对他们并无益处。长远来看，让他们自己照顾自己是更好，对他们帮助更大。"
    }
  ]
}
