{
  "group": "天空与猫",
  "cards": [
    {
      "name": "O·天空·首牌",
      "牌意": "现在你正进入风族的领地。他们象征着你必须保护自己和保持智慧。你在这里碰到猫都要小心应付。风族之旅就是冲突之旅。",
      "猫的启示": "现在你的思维必须警觉和感觉清晰。并用这种清醒确保适当的行动路线，远离有害的选择。建议你要谨慎，如果你能保持自己的正直未受任何损伤，也会取得很大的进步。如果你抽出这张牌提问，答案是一个谨慎的YES",
      "逆位": "现在为了取得有意义的进步，你的脑海里盘旋着太多的想法和问题。想法迅速涌现，但没有给予足够的关注而很快消失了或是遭到示威，有来自周围的干扰。如果你抽出这张牌提问，答案都是 NO 。"
    },
    {
      "name": "II·天空·二",
      "牌意": "风中带来其他猫进入的气味。他们是朋友还是敌人？风族猫抬起头，集中精力更仔细地辨别着。他下一步的行动取决于他现在所搜集的信息。如果流浪到一个充满敌意的猫的领地，后果就会很危险。除非他懂得更多，不然他只会呆在合适的地方。",
      "猫的启示": "在采取行动前，安静地呆在那里找到自己自己的方向，这可能需要耐心，但值得。匆忙离开去追寻模糊的的爱好不会有任何成果。收集更多的信息，注意细节，相信自己的直觉会帮助你找到安全的成功的行动路线。",
      "逆位": "现在你看到那个方向起风了，但你可能仍在怀疑自己的觉察力。在经历了一段时间的压力和紧张后，你的能量可能有点低。多等一阵再采取行动。直到你确定可以行动了。"
    },
    {
      "name": "III·天空·三",
      "牌意": "如果我们选择这样做，在那些最易碎的物品中，猫就会更优雅地行动。这些愿意制造麻烦的风族猫就会选择看自己能破坏多少，只为了好玩。只有当他们触地时做出碰撞，珍惜的装饰品或尊重才有价值。这些猫认为造成的破坏对他们而言是很滑稽的，他们对自己粗心的恶作剧也很高兴。",
      "猫的启示": "不要参与不重要的分歧或是不需要用脑的戏剧中，这些活动会放低你的状态。要抵制住那些只为找到自己的同伴而放弃自己价值的诱惑。比起跟那些喜欢制造麻烦和搅局的人一起，自己独处要好的多。",
      "逆位": "周围的事情就要跌落到那些恶作剧和制造麻烦的人身上了。如果你已经参与制造这样桥段的活动中，立刻修正。如果由此受伤了，就听天由命吧。无需再做评判 - 因为评判已经在这里了。"
    },
    {
      "name": "IV·天空·四",
      "牌意": "有时生在风族的猫不能忍受这个宗族占主动的冲突，控制自己的行为。这样温和的猫就会离开他们的族人进入薰衣草地抚慰他忙碌的灵魂。到时他将不得不回到他的族群那里处理这些挑战。但是至少现在，他跳出了那个世界和麻烦，深深地蜷缩在和平的梦乡中。",
      "猫的启示": "你需要找到一个安静的地方摆脱噪音和日常生活的众多要求，即使就很短的一段时间都行。如果你已参与到争吵或毫无生产力的讨论中，离开，独立思考一段时间，将会取得突破。回到重心将会帮你重新找到方向。",
      "逆位": "从麻烦的环境中逃避多次也是不赞成的。如果不采取行动，事情不会变好。为找到长久和平之路寻求帮助，而不是暂时的休战。是时候让其他人介入。"
    },
    {
      "name": "V·天空·五",
      "牌意": "其他族群欢迎新人，风族猫对外来者怀有疑心。年轻的雄猫成群结队地巡逻在他们的领地，挑战任何他们不认可的猫。这些恶棍单个时没有他们成群结队时勇敢。偶遇一只跟他们不同的斯芬克思猫，他们就凶残地欺负。这只无害的斯芬克斯猫必须希望他自己找到逃脱之路去一个温暖的欢迎他的地方。",
      "猫的启示": "跟没有荣誉感的人斗争你是无法胜出的。封闭的心没有推论，也无法劝说一颗封闭的心灵。如果你是欺负人的团伙中的一员或陷入了暴徒的统治，停止你的行为考虑一下你的行为。付出任何代价的胜利只是毫无意义的胜利。",
      "逆位": "是你正在处理过去发生在你身上的错事或是受伤的幸存者的情绪后果。仅从所受的心灵创伤来认同自己是不平衡的，把自己的权力放弃给那些伤害你的人。处理正在发生的事情，并释放有害记忆。"
    },
    {
      "name": "VI·天空·六",
      "牌意": "要成为风族一员并非易事。你要保护好自己，做好打架的准备，在潜行时要警惕敌人。这只猫已经有足够，离开没有他的战斗的愤怒，他退出舔舐伤口并思考自己的选择。果断时间他可能重回族群，也可能自称成一派。无论如何，他都要为明天战斗。",
      "猫的启示": "离开恶劣环境不是耻辱。不要让那种只要开始就要接受的观点误导你而不去止损。有时开始看起来很有吸引力的事情会一直这样进展的理论是站不住脚的。那些在思想上对你有影响的人会理解和支持你。",
      "逆位": "你可能会对为完成的事业或是把他人留在挫折中的感觉心存遗憾。预测真相几何？愧疚几多？你觉得自己必须与这些连在一起？这帮不了任何人，并会造成责无旁贷的错觉。让其他人为自己战斗。"
    },
    {
      "name": "VII·天空·七",
      "牌意": "挥舞着闪着红光的翅膀，一群黑鸟飞上天，惊动了风族猫，把她的注意力从她的猎物上移开。当她注意力被转移，一只狡猾的同族人溜进来偷走了老鼠。要看他是否能成功逃脱，或对她公正的一场战斗的受伤方是否会随时间而发生变动。",
      "猫的启示": "因为太多让你分神的事，你处在失去有价值东西的危险中。如果要达成目标你需要考虑你选在在什么上花时间和注意力。也可能是隐藏在表象背后的东西，你如此心事重重而没有注意到。集中精力。",
      "逆位": "如果你参与可疑的或不道德的行为中，让情景回到正规不论你是否参与。道歉，如需要，做出赔偿。如果这种行为已经持续了很长时间，而不是仅仅一会儿，要清楚重获信任需要时间。"
    },
    {
      "name": "VIII·天空·八",
      "牌意": "任由情绪的摆布，风族猫经常发现自己处于困难的境地。这只猫被突如其来的暴风雨困住，落下的树枝将她困在纠结中。感到恐慌，他就连加鞭笞，在这个过程中他可能伤到自己。如果他平静下来，寻找出口，他就能轻易逃脱，根本不会受伤的上路。然而他却在浪费精力跟根本不存在的敌人斗争。",
      "猫的启示": "情景并不像你想象的那样悲惨。但你感到被困没有选择时，平静下来，找到简单的解决办法。保持平静直到你不再害怕。鞭打周围只能使情况变得更糟。不要在你的担心中再加上这些小烦恼。用你的智慧找到解决办法。",
      "逆位": "你在经历考验，不管是否来自他人还是我们的宇宙。展示你即兴发挥的能力，找到新颖的解决办法。考虑一下这创新的经验 - 一旦你通过了测试，就会有成就感和自我尊重，也会得到别人的认可。"
    },
    {
      "name": "IX·天空·九",
      "牌意": "猫经常做梦而且梦境都激烈。梦中我们的想象的广度会让每一物种都感到惊奇，因为梦扩大到我们祖先的记忆中，梦到我们的过去和现在。更不要说可怕的和无法摆脱的噩梦。这只风族猫在他的梦里因为害怕之极而颤抖暴跳不已。在他醒后回到更安全的现实，梦中的情景也会萦绕很长时间。",
      "猫的启示": "控制你的恐惧就只是：恐惧。这些恐惧可能跟现实没有任何联系，只有在你感到脆弱时你才会相信。你陷入到生活的噩梦中，醒过来，将情景回放。",
      "逆位": "直面恐惧，战胜恐惧。盘点焦虑和担心的所有原因，然后采取行动管理他们，如需要寻求帮助。逃避和否认无法帮到你，现在就是对生活作出真正改变的时刻。"
    },
    {
      "name": "X·天空·十",
      "牌意": "这只风族猫被他的族人赶了出来，没有人向前来帮助他。受伤，饥饿，孤独，绝望，已到了其力量的极限。也许这就是他 9 条命中的一条要结束了，如果在其他宗族，他就会找到庇护和救治。不论发生什么，他知道自己的命将休。",
      "猫的启示": "是时候面对事实，对形势做出诚实的预测。你想要得尚未解决，你希望的也没有发生，至少没有按你预想的方式发生。乐观来说，这跟获得一样不好。只有你接受现实不抱有任何幻想，事情才可能变好。",
      "逆位": "你所遭受的弱势和失败被夸大了，没有如实地反映真正的现实。你可能让别人的思想和评判控制了，把他们的负面当成了自己的。这种负能量正使你下沉。摆脱这种负能量，恢复你的自我价值感。"
    },
    {
      "name": "XI·天空·幼猫",
      "牌意": "漂浮在上面的某种东西吸引了这只风族小猫的注意力。这是她第一次尝试跳起来，然后再跳一下，专注于她的目标。她正在学习征服敌人的战略。在这种情况下，她的敌人就是风自身，但她不需要知道这些。现在这是她全部的愿望。随着时间的推移有一天她会成功的。",
      "猫的启示": "你现在开始想象自己喜欢的生活的样子，参与新挑战的急切愿望。不要担心这过程中可能会摔几跤，不要让你的自我意识带你回到之前的安全区。渴望去做更伟大的事情。",
      "逆位": "尝试些你够不到的事情是好的，不要盲目或冲动采取行动，而这些行动可能危及你的安全。作决定时要谨慎。不成熟的行为不会推进你的事业。不要因自己或他人的挫折而草率行动。"
    },
    {
      "name": "XII·天空·雄猫",
      "牌意": "风族的猫都是最好的跳跃者和爬树者，在半空中比在地上感觉更自在。年轻时他们就学会了优雅起跳和着陆的准确距离。在小猫时他们就练好了空中技巧，风族雄猫是无情的猎手。安静地全神贯注地在猎物感知他的到来前偷袭她的猎物。他跳起来快的都来不及看。",
      "猫的启示": "在这种情况下采取进攻行动可能会带来你想要的，这可能需要别人付出代价。在追逐目标时不要忘记最基本的和善和体贴。你身心必须一致。",
      "逆位": "你必须对那些你曾经伤害过的人心怀怜悯。这不是脆弱的表现而是成熟和精神成长的标记。你正在学习在这个世界成功的新方法。"
    },
    {
      "name": "XIII·天空·猫王后",
      "牌意": "风族王后从字面上来看高于一切，她对空中的爱吸引她不断向上。从这崇高的角度看，她热切的看着。没有什么能逃脱她的注视。她冷静超然地俯瞰着这个世界。这位王后不经常跟她的伴侣一起，也与她的宗族谨慎地保持着距离。细心地执行这她的母仪天下的责任，但到小猫离开她的时候，她会轻易地让他们离开。跟她的美丽一样令人敬畏的，她也保持自己的想法。",
      "猫的启示": "你的机智和智慧会很好地服务你，你沟通的天资也会帮助你。尽管战略性联盟对你很有价值，但你要将私人关系保持臂距的长度。现在冷静的思想比情绪更重要。现在是获取洞察力和考虑未来对未来的决定。",
      "逆位": "当心不要用讽刺或严厉的批评伤害到他人。不是每个人都跟你一样皮厚，你可能遇到更犀利地。如果觉得太孤立和痛苦，相信那些了解你和能帮助你治愈的同伴的忠告。"
    },
    {
      "name": "XIV·天空·猫国王",
      "牌意": "通过铁腕和冷静的思想统治着风族。他周围的人都有暴力和残忍倾向，国王必须超然着眼大局。他的臣民谨慎地尊重他，也有些害怕他。他不显现自己内心的感受或轻易不发脾气。没有什么凝视着风族国王，不是风不是天气或风族的野蛮变迁。",
      "猫的启示": "你的经历和智慧让你清晰地洞察当前的形势，并建议他人不要对结果有感情依恋。当心不要过于理性，没有身心一致。他人可能不愿意听那些没有感情的忠告。",
      "逆位": "你超然的力量走的太远了。有语言甚至行为变得残忍或轻率的危险。如果你不情绪柔软锻炼敏捷的智力，这种力量反过来伤害到你自己。暴君跟领导不同。"
    }
  ]
}