{
  "group": "海洋与猫",
  "cards": [
    {
      "name": "O·海洋·首牌",
      "牌意": "你正在进入水族的领地。他们象征着想象力和情感可以自由流动的地方。这里遇到的猫欢迎你并倾听你的梦想。水族猫之旅就是爱的旅程。",
      "猫的启示": "这是回应你内心呼唤的时候了。如果你敞开胸怀接受快乐，你会毫不费力的就得到快乐。你会收获和善，友情和爱情。如果你抽出这张牌问问题，答案都是 YES 。",
      "逆位": "这些东西在减少并远离你。不管是否有形的，还是你自己的情感回应。接受事物的自然流动，也让悲伤流动，相信随着时间的推移幸福还会回来。如果你抽出这张牌问问题，答案就会是 NO 。"
    },
    {
      "name": "II·海洋·二",
      "牌意": "啊，浪漫！这是你凝视别人的眼睛并看到最好的自己的魔力时刻。爱人的任何东西都是迷人的，皮毛香气以及所有构成个性的迷人特质。最初的迷恋会加深或褪色，但只要其存在，世界就是为你们俩个存在的。",
      "猫的启示": "新的罗曼史即将开始或是为现存的关系注入新的浪漫气息。你可以相信把你引向爱人的直觉，你的心现在是安全的。",
      "逆位": "你和爱人之间出现了问题，不论是内部还是外部。爱意流动遭到阻碍，也许是暂时的。找到这种阻碍的原因 - 恐惧，回忆，嫉妒，仍在影响现在的选择与过去的关系。"
    },
    {
      "name": "III·海洋·三",
      "牌意": "当然我们珍惜我们的族人，但是最不可能的地方也能遇其他朋友。友谊为分歧架起桥梁，找到共同的快乐：阳光照耀皮毛的温暖，潮汐的乐章，美味的鱼。真正的朋友能够共享美好的寂静。从彼此的靠近中获取安慰。就这样单纯在一起的时光就能加强彼此的关系。",
      "猫的启示": "为朋友的重聚选好时刻。记住跟你一样，其他人也会从大家在一起的时光中获得快乐。并且这并不需要特定的场合或活动，在一起就足够了。庆祝生命中的友谊吧。",
      "逆位": "有时候每个人都朝向不同的方向。每个人都有自己的优先和关注点。繁琐的接触可能代替有意义的交换。现在唤醒友谊并采取行动去加强友谊。"
    },
    {
      "name": "IV·海洋·四",
      "牌意": "水族猫可能是忧郁的，他们对生活的热情就像潮汐那样起伏。但他们陷入不满足不满意时，即使最迷人的景色也无法感染他们。虽然经验告诉他们生活远不是枯燥的，此刻似乎没有值得做的事情。这种冷淡随着时间的推移将会过去。",
      "猫的启示": "如果现在没有什么抓住你的注意或是引起你的兴趣，就维持现状吧。如果没有看到自己喜欢的选项，就不要选择。如果这张牌代表别人，最好让他们自己独处直到他们的不再忧郁，皮毛不再皱起。",
      "逆位": "对于现在无精打采问题的解决办法慢慢浮现，最好的发现就是听从你的梦想并注意日常的美景。内在的懒怠正在趋向平静，冥想的洞察力。关注迹象，预兆或是通灵消息。"
    },
    {
      "name": "V·海洋·五",
      "牌意": "猫不喜欢失败。失去尊严对我们而言非常痛苦，当我们的尝试没有成功却看到其他人做到了会让我们感觉更糟。这只猫在捕鱼是不小心的跌落。鱼仍在那里，你可以再试一次。但他却首先趋向他消退的精神气和潮湿的骄傲。",
      "猫的启示": "当遭受挫折和摒弃时，自己想要的东西没有得到时，自然会感到失望。你要知道这种故事不会结束。要重聚力量再试。",
      "逆位": "现在机会就在你周围，更多的还在路上。确保你已经完全丢掉之前的遗憾，对将要发生的满怀希望，所以你已经准备好充分利用现在的一切对你有益的东西。"
    },
    {
      "name": "VI·海洋·六",
      "牌意": "我们一生中都在玩耍，但是作为小猫，好玩的食物却有着特殊的含义，因为那不受成人自我意识约束。角色扮演的游戏很能吸引小猫，当假装奔向猎物，当猛地扑向同伴他们因害怕发出的欢快的叫声都让小猫们兴奋地颤抖着。勇敢的水族小猫想象着自己如老虎般的跃进池里。",
      "猫的启示": "自尊和成熟是有价值的品质名，但我们也必须保持玩的能力。年轻的精神使生活充满快乐。回想下自己的童年，什么给你带来最大的快乐？怎么能重拾那种天真无邪的幸福？",
      "逆位": "太沉湎于回忆或是太怀旧，可能会对现实有帮助也可能没有。重回现实，接受长大应承担的责任。游戏与有意义的目标中找到平在有创造性的追求中充分利用你的幻想和想象力。"
    },
    {
      "name": "VII·海洋·七",
      "牌意": "这只水族猫被眼前的景象迷住，是如此的清晰和引人入胜但却怎么也抓不住。是真的么？他可以相信这些么？如果不能抓住托住的东西，那么这样的东西是存在么？这只猫他自己陷入了幻想与真实中。这是他无法理解的猎物，更不要说征服了。",
      "猫的启示": "某些你在追逐的东西是幻觉超出了你的掌握。但你却不能依靠这个存货。你需要实际存在的选择来创造你想要和需要的现实生活。",
      "逆位": "你的疑惑正在让你起来戳破幻觉的肥皂泡，让你看清现实。现在就比较容易做出决定，你可以相信你将要获得的信息。采取行动，你的梦想即将成真。"
    },
    {
      "name": "VIII·海洋·八",
      "牌意": "在远离家的地方徘徊迷路，这只水族猫来到了一座古老的宗族神龛。也许这个地方曾经不那么荒凉，也许这些神龛就是安抚那些孤独的徘徊者。停下自己的旅行，休息一下，这只猫在听贝壳中传来的大海歌唱的回声，他的心渴望着他爱的。",
      "猫的启示": "你是否已经离开了保持自己良好状态的最重要的那些东西？是否远离同伴的陪伴和情感关怀而被放逐？对脆弱的担心会使你远离群体而孤立。听从自己的内心找到回家的路。",
      "逆位": "你可能保留那些正在破坏或至少在消耗你精神的东西。如果你觉得太沮丧无法找到走出目前精神消耗的情形，是时候寻求帮助和指引。有时内心最深处的渴望太沉寂了而无法被听到。"
    },
    {
      "name": "IX·海洋·九",
      "牌意": "我们花在睡觉上的时间不单单是休息更是为了体能的恢复。梦境中我们看到了所有我们渴望并值得拥有的神奇的东西，希望得到他们，我们就开始努力让他们成真。在这魔力的想象中，没有担心，没有怀疑，只有甜蜜，和良好状态的保证。猫能梦到的任何事物都会成真。",
      "猫的启示": "如果你相信，你最亲爱的梦和最诚挚的希望都能成真。所有对你有意义的爱，美丽和幸福。敞开心扉接纳他们。好事情都会走向那些渴望得到它们的人。",
      "逆位": "你希望自己值得得到幸福么？你真的希望宇宙为你保持美好和快乐？不愿意表达自己的希望并付诸行动就会阻碍他们成真。不要在担心和缺失自爱中丧失机会。"
    },
    {
      "name": "X·海洋·十",
      "牌意": "对猫族的奉献如大海般深沉。但其表现形式可能会有起伏，因为我们是依赖情绪和情感生活的生物。对彼此而言超越任何小冲突都可能是绝对的承担。这就是宗族的意义。它开始掩藏对家庭爱的拥抱。",
      "猫的启示": "寻求宗族的帮助，不论是血亲家庭还是那些身心相连的那些人。家庭的力量就在于在加强整体力量的时候也要接受个人价值的增值。这种一致性就会延伸倒其他人。欢迎这些可爱的人加入到你的朋友圈。",
      "逆位": "在一起太多，即使在最亲密的家庭也会造成怒气和争吵。现在你可能觉得太拥挤了，需要一些空间来恢复对自己爱的人的感激。如果现在你有合作关系并有了后代，单独跟自己的伴侣一起会好些。"
    },
    {
      "name": "XI·海洋·幼猫",
      "牌意": "在他首次的海边参观，水族小猫觉得那粼粼的微波迷人极了。他高兴地前后追逐着。她对随后发生的毫无准备，波浪在追逐她。小猫对大海的力量和无限感到惊奇，但她很快就会学会。",
      "猫的启示": "情感的波浪在你周围旋转，而且就像小猫知道波浪一样，你正在学习处理这些波浪。你对不论是好的还是坏的的感觉还停留在表面，对自己感到同情。随着我们日益成熟和明智，内心深处的起伏不再那么可怕，而且我们愿意陷入其中",
      "逆位": "你的情绪占据了控制地位，除非你学会控制他们，不然你就会被控制了。现在不要采取不成熟的行动，或给自己夸张的冲动让步。如果过去曾遭受创伤，现在可以释放这种创伤，找到感情的治愈方法。"
    },
    {
      "name": "XII·海洋·雄猫",
      "牌意": "在平和的阳光普照的海滩上，水族雄猫在邀请关怀。这只雄猫为爱而活，并愿意在追逐中受伤。尽管可能比起一个可靠的拍档。他有点轻率，但水族雄猫就是依赖他们的率真和真诚的感情赢得伴侣和朋友。可以肯定的是它对异性有吸引力，他认为你非常美丽。",
      "猫的启示": "让你的热枕带你去寻找你的幸福不管这幸福可能是你的伴侣还是任何激情的兴趣。只要遵从自己的内心，就没有什么可怕的。如果这张牌不代表你，可能代表一场浪漫或让人心动的机会正在靠近你。",
      "逆位": "确保你和你感情的对象都怀有同样的期望。不要玩弄别人的情感或轻率的追求浪漫。那些在你看来轻松和好玩的事情对别人而言可能就是件严肃的事情，反之亦然。"
    },
    {
      "name": "XIII·海洋·猫王后",
      "牌意": "水族王后安静幸福的凝视着自己所有的世界。她对家庭和族人的感情很直观和敏感，就像温柔的妈妈对小猫的感情，她在他们成熟后也温柔地奉献着自己。她梦幻般的天性和细腻的感情吸引了其他猫对她的友谊和浪漫，一旦她选择了自己的伴侣，就全身心地对待。王后的爱就像装饰她王国的喷泉一样自由地流出。",
      "猫的启示": "敞开胸怀倾听你的梦想，你感到莫大的快乐。尊重内在直觉的指引和敏感的天性。相信留给自己爱人的率真的感情会备受感激。如果这张牌不代表一个人，就表示这是对别人心理意识和协调的细微差别的时刻。",
      "逆位": "当你不要成为心灵海绵，吸收别人的情绪并构成了自己的情绪。不要抓你爱的人太紧让他们感觉要满足你的每一个幸福或为了他们自己的幸福却要听从你的主意而倍感压抑。学会超然的同情。"
    },
    {
      "name": "XIV·海洋·猫国王",
      "牌意": "就像他的王后，水族国王也极富爱心。他的天性是冷静，能很好的控制自己的情绪，他寻求的最重要的是平和与和谐。尽管若必要他会保护自己的家庭，但他更愿意鼓励和解和妥协。他的伴侣通常超越了宗族，因为经常发现他在斗争中寻求智慧，细腻而强壮，国王是一个敏感的伴侣和保护力很强的父亲。",
      "猫的启示": "别人看到的和平的力量和保证。你赢得尊重是当之无愧的和平缔造者，因为你真诚和善地惠及他人。你影响力所及范围内每个人都从你明智的感情中获益；而且也没有把别人的问题变成自己的。",
      "逆位": "有助于看清现在情形的方方面面，但有时错了就是错了。不要让自己为了倾向和谐而对自己的价值做出退让。你可能需要让别人失望但也要保持真我。"
    }
  ]
}